{
  "users": [
    {
      "email": "test@example.com",
      "username": "testuser",
      "password": "123456",
      "id": 1,
      "image": ""
    },
    {
      "email": "example@mail.ru",
      "password": "$2a$10$tFbGKP81c/5L8oA0hBLIlelrzbylrjg8owc9VFKm0hG7/idOp18yq",
      "username": "IreneSun",
      "id": 2,
      "image": ""
    }
  ],
  "articles": [
    {
      "id": 1,
      "slug": "----",
      "title": "Марафон: бег на пределе возможностей",
      "description": "Погружаемся в мир марафонского бега — как подготовиться и не сломаться",
      "body": "Марафон — это не только физическая нагрузка, но и проверка силы воли. Подготовка занимает месяцы, а иногда и годы. Важно грамотно распределять силы на дистанции и не переоценить себя на старте. Особое внимание уделите восстановлению: сон и питание критически важны. Не забывайте о ментальном настрое — марафон бежит не только тело, но и разум. Если всё сделано правильно, финиш принесёт незабываемое ощущение победы. \n",
      "tagList": [
        "бег",
        "марафон"
      ],
      "favoritesCount": 0,
      "likedBy": [],
      "author": {
        "username": "run_guru",
        "image": "https://i.pravatar.cc/40?img=23"
      },
      "createdAt": "2025-04-09T10:15:00.000Z"
    },
    {
      "id": 2,
      "slug": "velosport-vetrom-po-lice",
      "title": "Велоспорт: с ветром по лицу",
      "description": "Почему велосипед — это не только средство передвижения, но и спорт",
      "body": "Велоспорт развивает выносливость и укрепляет сердечно-сосудистую систему. Важно правильно подобрать велосипед и настроить посадку. Первые километры могут быть сложными, особенно в подъёмы, но это пройдёт. Тренировки на свежем воздухе повышают настроение и снижают стресс. Соревновательный дух помогает расти и достигать новых целей. Велоспорт — отличный способ познать свои границы и свободу движения.",
      "favoritesCount": 0,
      "likedBy": [],
      "author": {
        "username": "velo_master",
        "image": "https://i.pravatar.cc/40?img=25"
      },
      "createdAt": "2025-04-08T14:20:00.000Z",
      "tagList": [
        "велоспорт"
      ]
    },
    {
      "id": 3,
      "slug": "plavanie-sila-vody",
      "title": "Плавание: сила воды",
      "description": "Чем полезно плавание для тела и духа",
      "body": "Плавание включает все группы мышц и одновременно щадит суставы. Это один из немногих видов спорта, подходящих всем возрастам. Регулярные занятия улучшают осанку и дыхательную функцию. Плавание снимает стресс, укрепляет нервную систему и помогает расслабиться. Контакт с водой сам по себе обладает терапевтическим эффектом. Это не только тренировка тела, но и путь к внутреннему равновесию.",
      "favoritesCount": 1,
      "author": {
        "username": "swim_coach",
        "image": "https://i.pravatar.cc/40?img=27"
      },
      "createdAt": "2025-04-07T09:00:00.000Z",
      "tagList": [
        "пловцы",
        "пловчихи",
        "плов"
      ],
      "likedBy": [
        "run_guru"
      ]
    },
    {
      "id": 4,
      "slug": "gimnastika-gibkost-i-sila",
      "title": "Гимнастика: гибкость и сила",
      "description": "Как гимнастика развивает тело и дисциплину",
      "body": "Гимнастика — это баланс между силой, координацией и пластикой. Тренировки начинаются с раннего возраста, но подойдут и взрослым. Она развивает не только физику, но и характер: точность, дисциплину, выдержку. Каждое движение требует концентрации и техники. Соревновательный элемент делает занятия особенно захватывающими. Гимнастика формирует сильную и уверенную личность.",
      "favoritesCount": 0,
      "likedBy": [],
      "author": {
        "username": "flex_trainer",
        "image": "https://i.pravatar.cc/40?img=29"
      },
      "createdAt": "2025-04-06T12:45:00.000Z",
      "tagList": [
        "гимнастика",
        "боль"
      ]
    },
    {
      "id": 5,
      "slug": "basketbol-komandnyj-duh",
      "title": "Баскетбол: командный дух и энергия",
      "description": "Почему баскетбол — это не просто мяч и кольцо",
      "body": "Баскетбол развивает реакцию, скорость и стратегическое мышление. Это динамичный и энергозатратный вид спорта. Игроки учатся работать в команде, передавать и принимать решения на ходу. Прыжки, смена направлений и броски — всё это требует подготовки. Игра на площадке учит уважению к сопернику и ответственности. Баскетбол — это не просто спорт, это стиль жизни для миллионов.",
      "favoritesCount": 0,
      "likedBy": [],
      "author": {
        "username": "coach_dunk",
        "image": "https://i.pravatar.cc/40?img=33"
      },
      "createdAt": "2025-04-05T15:30:00.000Z",
      "tagList": [
        "баскетбол",
        "джорданы",
        "курочкаkfc"
      ]
    },
    {
      "id": 6,
      "slug": "yoga-dlya-balansa",
      "title": "Йога для баланса тела и ума",
      "description": "Как йога помогает сохранить спокойствие в суете мира",
      "body": "Йога — это больше, чем растяжка. Это практика осознанности и гармонии. Каждая асана направлена на восстановление внутреннего равновесия. Дыхательные техники помогают управлять эмоциями и стрессом. Йога укрепляет мышцы, улучшает гибкость и способствует долголетию. Регулярные занятия улучшают сон, пищеварение и настроение. Йога — это образ жизни, ведущий к спокойствию и ясности.",
      "favoritesCount": 16,
      "likedBy": [],
      "author": {
        "username": "zen_mind",
        "image": "https://i.pravatar.cc/40?img=35"
      },
      "createdAt": "2025-04-04T08:10:00.000Z",
      "tagList": [
        "йога",
        "гибкость",
        "осознанность"
      ]
    }
  ]
}